In [ ]:
! mkdir -p datasets
%cd datasets
! wget -nc https://raw.githubusercontent.com/pablonoya/zigzag-ml/master/datasets/panel_data.csv
%cd ..

# ¬øPandas? üêºüêº
Es una **librer√≠a** de Python que permite manejar **datos tabulares**, el nombre deriva de *panel datas*, un tipo de tabla que muestra datos sobre mediciones a lo largo del tiempo.

|persona | a√±o | ingreso | edad |
|--------|-----|---------|------|
| 1 | 2010 | 1300  | 22  |
| 1 | 2011  | 1450  | 23 |
| 2 | 2009  | 2300  | 25  |
| 3 | 2010  | 2600  | 27  |


Cuenta con funciones para leer tablas, analizarlas, seleccionar columnas, realizar limpieza de datos y transformaciones con estos ü§Ø.  
Operaciones imprescindibles cuando queremos que la m√°quina aprenda de los datos üòâ.

# Comma-separated values
El **formato** m√°s extendido para almacenar datos tabulares es ~~excel~~ **.csv**, este es un archivo de texto plano que describe **cada fila en una linea** de texto y **separa las columnas por comas** (sin espacios). La **primera fila es el encabezado**, contiene los nombres de cada columna, las siguientes filas contienen los datos.

Para nuestra tabla, el archivo .csv tiene este formato:

```
persona,a√±o,ingreso,edad
1,2010,1300,22
1,2010,1450,23
 ...
```
Esto nos permite almacenar grandes cantidades de datos de forma f√°cil y sin que ocupen demasiado espacio, pero no son sencillos de manejar si los tratamos como texto plano ‚òπÔ∏è.

# Cargando csv
La funci√≥n `pandas.read_csv` nos permite leer archivos, esta recibe una cadena con el **directorio** donde est√° el archivo, y retorna un objeto de tipo *DataFrame* el cual tambi√©n contiene un √≠ndice y tiene m√©todos como `head` que nos permite ver las **primeras filas** de la tabla, por defecto nos mostrar√° cinco.

In [1]:
import pandas as pd

data = pd.read_csv('./datasets/panel_data.csv')
type(data)

pandas.core.frame.DataFrame

In [2]:
data.head()

   persona   a√±o  ingreso  edad
0        1  2010     1300    22
1        1  2010     1450    23
2        2  2009     2300    25
3        3  2010     2600    27
4        3  2011     2500    28

Podemos escoger el **n√∫mero** de filas que nos mostrar√° mandando un entero como argumento

In [3]:
data.head(3)

   persona   a√±o  ingreso  edad
0        1  2010     1300    22
1        1  2010     1450    23
2        2  2009     2300    25

# Mirando DataFrames
Estos objetos ya cuentan con los m√©todos necesarios para las operaciones que necesitamos, adem√°s de m√©todos que nos proporcionan informaci√≥n sobre el mismo, por ejemplo, podemos generar un **resumen** de esta tabla utilizando el m√©todo `info`.

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   persona  6 non-null      int64
 1   a√±o      6 non-null      int64
 2   ingreso  6 non-null      int64
 3   edad     6 non-null      int64
dtypes: int64(4)
memory usage: 320.0 bytes

Este resumen muestra **cu√°ntos** datos tenemos, si tenemos datos **nulos** y el **tipo de dato** o 'dtype' de cada columna.
Para esta tabla, no tenemos datos nulos, y todas las columnas tienen enteros.

Tambi√©n podemos obtener algunos datos estad√≠sticos con el m√©todo `describe`

In [5]:
data.describe()

        persona          a√±o      ingreso      edad
count  6.000000     6.000000     6.000000   6.00000
mean   2.333333  2010.166667  2225.000000  26.00000
std    1.211060     0.752773   725.086202   3.34664
min    1.000000  2009.000000  1300.000000  22.00000
25%    1.250000  2010.000000  1662.500000  23.50000
50%    2.500000  2010.000000  2400.000000  26.00000
75%    3.000000  2010.750000  2575.000000  27.75000
max    4.000000  2011.000000  3200.000000  31.00000

Y verificar si contamos con elementos vac√≠os con el m√©todo `isna` este mostrar√° verdadero o falso seg√∫n sea el caso.

In [6]:
data.isna()

   persona    a√±o  ingreso   edad
0    False  False    False  False
1    False  False    False  False
2    False  False    False  False
3    False  False    False  False
4    False  False    False  False
5    False  False    False  False

Los cuales podemos eliminar con el m√©todo `dropna` en nuestro caso no temos elementos vac√≠os, por lo que la tabla no cambiar√°.

In [8]:
data = data.dropna()
data.head(6)

   persona   a√±o  ingreso  edad
0        1  2010     1300    22
1        1  2010     1450    23
2        2  2009     2300    25
3        3  2010     2600    27
4        3  2011     2500    28
5        4  2011     3200    31

## Columnas
Podemos **manipular** las columnas como si tuvi√©ramos un **diccionario**, esta operaci√≥n nos devuelve un objeto *Series*, por lo que tambi√©n nos mostrar√° un √≠ndice y el *dtype* de la columna al imprimirlo. Adicionalmente, podemos pasar una **lista** de nombres de columnas, intenta pasar algunas üòÉ

In [9]:
columna = "edad"

print(data[columna])
type(data[columna])

0    22
1    23
2    25
3    27
4    28
5    31
Name: edad, dtype: int64

pandas.core.series.Series

De la misma manera podemos **definir nuevas columnas** de manera din√°mica.  
Si deseamos almacenar el ingreso en miles en vez de unidades podr√≠amos utilizar el siguiente c√≥digo:

In [10]:
data["ingreso_en_miles"] = data["ingreso"] / 1000

data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   persona           6 non-null      int64
 1   a√±o               6 non-null      int64
 2   ingreso           6 non-null      int64
 3   edad              6 non-null      int64
 4   ingreso_en_miles  6 non-null      float64
dtypes: float64(1), int64(4)
memory usage: 288.0 bytes

Si deseamos eliminar la columna original utilizamos el m√©todo `drop` el argumento `axis="columns"` indica que eliminaremos una columna.

In [13]:
data.drop('ingreso', axis="columns", inplace=True)

Por defecto `drop` no altera la variable original, en su lugar, retorna una copia con los cambios. Esto puede ser √∫til para evitar borrones no deseados.

In [14]:
data.head()

   persona   a√±o  edad  ingreso_en_miles
0        1  2010    22              1.30
1        1  2010    23              1.45
2        2  2009    25              2.30
3        3  2010    27              2.60
4        3  2011    28              2.50

Si deseamos **alterar la instancia original**, debemos a√±adir el argumento `inplace=True` a la funci√≥n `drop`, int√©ntalo en la celda de m√°s arriba üòâ

## Filas
Para leer filas podemos usar el **√≠ndice**, pero debe ser junto al atributo `iloc`, este tambi√©n nos permite **manipularlo como matriz**, para tener acceso de la forma **\[fila\]\[columna\]** o bien **\[fila, columna\]**

Tambien podemos usar *slicing* para definir rangos, prueba definiendo alguno üòé

In [23]:
fila = 2
print(data.iloc[fila:])

   persona   a√±o  edad  ingreso_en_miles
2        2  2009    25               2.3
3        3  2010    27               2.6
4        3  2011    28               2.5
5        4  2011    31               3.2

In [16]:
fila, columna = 2, 2
print(data.iloc[fila][columna])
print(data.iloc[fila, columna])

25.0
25

In [18]:
# slicing
lista = [2, 5, 4, 6, 9]
lista[3]

6

In [24]:
lista[3:]

[6, 9]

## Filtrando filas
Una de las operaciones m√°s curiosas es pasar una **lista de booleanos como √≠ndice**, esta debe tener el **n√∫mero de filas** del *DataFrame*, podemos obtener este dato usando la funci√≥n `len` sobre el mismo.

In [25]:
num_filas = len(data)
num_filas

6

In [26]:
indices_bool = [True] * num_filas
indices_bool

[True, True, True, True, True, True]

In [28]:
indices_bool[2] = False
indices_bool

[True, True, False, True, True, True]

In [29]:
data[indices_bool]

   persona   a√±o  edad  ingreso_en_miles
0        1  2010    22              1.30
1        1  2010    23              1.45
3        3  2010    27              2.60
4        3  2011    28              2.50
5        4  2011    31              3.20

0, 1, 3, 4, ... ¬°Falta la fila con √≠ndice 2! üò∞  
Y aprovecharemos eso para **filtrar** las filas üòé si escribimos una **condici√≥n** con alguna columna del *DataFrame*...

In [30]:
data['edad'] > 23

0    False
1    False
2     True
3     True
4     True
5     True
Name: edad, dtype: bool

Obtendremos una *Series* de booleanos, la cual tambi√©n podemos usar como √≠ndice para filtrar üòé.

In [31]:
condicion = data['edad'] > 23
data[condicion]

   persona   a√±o  edad  ingreso_en_miles
2        2  2009    25               2.3
3        3  2010    27               2.6
4        3  2011    28               2.5
5        4  2011    31               3.2

Si quieres usar **varias condiciones**, debes utilizar los operadores l√≥gicos `&` y `|`, que corresponden a `and` y `or` en Python, pero no podemos usar esas sentencias ‚òπÔ∏è. Adem√°s, debes encerrar las condiciones en par√©ntesis.

In [35]:
condicion = (data['edad'] > 23) & (data['a√±o'] > 2010)
data[condicion]

   persona   a√±o  edad  ingreso_en_miles
4        3  2011    28               2.5
5        4  2011    31               3.2

No es la forma m√°s c√≥moda de escribirlas, pero existe una mejor, utilizando el m√©todo `query` podemos declarar las **condiciones como una cadena**.

In [34]:
data.query("edad > 23 & a√±o > 2010")

   persona   a√±o  edad  ingreso_en_miles
4        3  2011    28               2.5
5        4  2011    31               3.2

# Ejercicios
En algunas ocasiones, contaremos con columnas irrelevantes, como un identificador o nombres de personas.  
¬øC√≥mo evitamos cargarlas en un DataFrame? utiliza el archivo "panel_data.csv" para **evitar cargar la columna** "persona".

In [ ]:
# recuerda haber cargado el dataset y mira la documentaci√≥n

Tener una tabla de verdaderos y falsos para verificar si existen valores nulos no es nada pr√°ctico.   
¬øQu√© maneras se te ocurren para **contar valores nulos** en un dataset?

In [ ]:
# True puede ser 1 y False 0

# Pandas listo
Estas ser√≠an algunas de las operaciones m√°s b√°sicas para manejar tablas en pandas üêº  
Continuemos con el ["Hola mundo" del Machine Learning](2_Hola_mundo.ipynb)